// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

Console.WriteLine("Введите номер от 1 до 7");
string numberDay = Console.ReadLine();
if (numberDay == "1")
    {Console.WriteLine("будний день");}

   else if (numberDay == "2")
    {Console.WriteLine("будний день");}

   else if (numberDay == "3")
    {Console.WriteLine("будний день");}

   else if (numberDay == "4")
    {Console.WriteLine("будний день");}

   else if (numberDay == "5")
    {Console.WriteLine("будний день");}

   else if (numberDay == "6")
    {Console.WriteLine("выходной день");}

   else if (numberDay == "7")
    {Console.WriteLine("выходной день");}
